# PRACTICAL QUES 8

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = [["Shah","Male",114000.00],["Vats"," Male",65000.00],["Vats ","Female",43150.00],["Kumar", "Female ",69500.00],
        ["Vats", "Female", 155000.00],["Kumar ","Male", 103000.00],["Shah", "Male" ,55000.00],
        ["Shah", "Female", 112400.00],["Kumar ","Female",81030.00],["Vats", "Male", 71900.00]]

In [16]:
family = pd.DataFrame(data=data, columns=["Name" ,"Gender", "MonthlyIncome"])
family

     Name   Gender  MonthlyIncome
0    Shah     Male       114000.0
1    Vats     Male        65000.0
2   Vats    Female        43150.0
3   Kumar  Female         69500.0
4    Vats   Female       155000.0
5  Kumar      Male       103000.0
6    Shah     Male        55000.0
7    Shah   Female       112400.0
8  Kumar    Female        81030.0
9    Vats     Male        71900.0

In [15]:
family.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           10 non-null     object
 1   Gender         10 non-null     object
 2   MonthlyIncome  10 non-null     float64
dtypes: float64(1), object(2)
memory usage: 368.0+ bytes

## PART A

In [14]:
familywise = family.groupby('Name')
familywise.describe().transpose()

Name                   Kumar         Kumar            Shah           Vats  \
MonthlyIncome count      1.0       2.000000       3.000000       3.000000
              mean   69500.0   92015.000000   93800.000000   97300.000000
              std        NaN   15535.135983   33611.307621   50088.621462
              min    69500.0   81030.000000   55000.000000   65000.000000
              25%    69500.0   86522.500000   83700.000000   68450.000000
              50%    69500.0   92015.000000  112400.000000   71900.000000
              75%    69500.0   97507.500000  113200.000000  113450.000000
              max    69500.0  103000.000000  114000.000000  155000.000000

Name                   Vats
MonthlyIncome count      1.0
              mean   43150.0
              std        NaN
              min    43150.0
              25%    43150.0
              50%    43150.0
              75%    43150.0
              max    43150.0

familywise.sum()

## PART B

In [49]:
familywise.max()

         Gender  MonthlyIncome
Name
Kumar   Female         69500.0
Kumar      Male       103000.0
Shah       Male       114000.0
Vats       Male       155000.0
Vats     Female        43150.0

## PART C

## PART D

In [24]:
family.groupby('Name').loc[]